var ca = java.util.Calendar.getInstance();
var 获取年 = ca.get(java.util.Calendar.YEAR);
var 获取日= ca.get(java.util.Calendar.DATE);
var 获取月= ca.get(java.util.Calendar.MONTH)+1;
var 获取日期= (获取年*10000)+(获取月*100)+获取日; //获取日期
var status = 0;
var text = "";
var 每日可完成次数 = 10;
var 获取任务完成次数;
var 获取任务开始次数;
var 任务所需道具;
var 满积分 = 300;
var 拥有积分;
var 积分宝箱 = Array(50,100,150,200,250,300);//每种宝箱领取需要对应数值的积分
var 任务难度升级 = Array(50,100,150,200,235);//人物达到对应等级可进行升级
var 完成任务 = Array(
    //完成度=1为简单 2为普通 3为完全 4为超额,需要的数量,奖励金币,奖励积分
	Array(0,0, 0*0, 0),//这段凑数用的 无视掉
	Array(1,50, 50*55500, 2),//简单完成
	Array(2,100, 120*10006660, 4),//普通完成
	Array(3,150, 300*1006600, 6),//完全完成
	Array(4,200, 500*1006600, 8)//超额完成
        );
var 积分宝箱奖励金币;
var 获得经验;
var 积分宝箱奖励 = Array(//这功能还未启用
    //奖励物品代码,奖励数量,需要对应积分
	//50积分
	Array(4032226, 3, 50),
	Array(4032226, 3, 50),
	Array(4032226, 3, 50),
	//100积分
	Array(2028175, 3, 100),
	Array(2028175, 3, 100),
	Array(2028175, 3, 100),
	//150积分
	Array(2431995, 1, 150),
	Array(2431995, 1, 150),
	Array(2431995, 1, 150),
	//200积分
	Array(2431944, 1, 200),
	Array(2431944, 1, 200),
	Array(2431944, 1, 200),
	//250积分
	Array(2435733, 50, 250),
	Array(2435733, 50, 250),
	Array(2435733, 50, 250),
    //300积分
	Array(2431938, 1, 300),
	Array(2431938, 1, 300),
    Array(2431938, 1, 300)
        );
var 所有材料文本 = Array(
Array(4000000, 50 , 104010100)//   蓝色蜗牛的壳
);

var 难度50材料 = Array(
// 金银岛
Array(4000000, 50 , 104010100), //   蓝色蜗牛的壳
Array(4000001, 50 , 100010000), //   花蘑菇盖
Array(4000005, 50, 102020100), //  叶子
Array(4000006, 50, 103010000), //  三眼章鱼触角
Array(4000008, 50, 100020400), // 道符
Array(4000009, 50, 100020300), //  蓝蘑菇盖
Array(4000010, 50, 101010000), //  绿水灵珠
Array(4000013, 50, 101030101), // 风独眼兽之尾
Array(4000014, 50, 105010000), //  龙的头骨
Array(4000017, 50, 120020000), // 猪头
Array(4000021, 50, 102030000), // 动物皮
Array(4000022, 50, 100040000), // 石块
Array(4000023, 50, 101030201), //  冰独眼兽之尾
Array(4000024, 50, 102030400), //  火野猪尖牙
Array(4000026, 50, 101040000), // 猴子娃娃
Array(4000030, 50, 105020400), // 龙皮
Array(4000033, 50, 103030300), // 黑鳄鱼皮
Array(4000034, 50, 103030000), // 蛇皮
Array(4000036, 50, 103020410), //  奇妙的药
Array(4000039, 50, 102030100), //  铁甲猪蹄
Array(4000041, 50, 101040320), //  巫婆的试验用青蛙
Array(4000042, 50, 103020100), //  蝙蝠翅膀
Array(4000043, 50, 120030100), //  红螃蟹钳
Array(4000044, 50, 120030300), //  青螃蟹钳
Array(4000045, 50, 120030500), //  乌龟壳
Array(4000046, 50, 105030500), //  长枪牛魔王之角
Array(4000028, 50, 105030200), // 月牙牛魔王的角
Array(4000185, 50, 105020300),  // 寒冰背部骨
Array(4000186, 50, 105020300),  // 黑龙之角
Array(4000196, 50, 102040000),  // 木面怪人所带在脸上的木板
Array(4000197, 50, 102040100),  // 石面怪人所带在脸上的石板
//天空之城
Array(4000069, 50, 211041100),  // 僵尸丢失的臼齿
Array(4000070, 50, 200010111),  // 红独角狮的尾
Array(4000071, 50, 200010121),  // 黄独角狮尾
Array(4000072, 50, 200010131),  // 蓝独角狮的尾
Array(4000073, 50, 200010110),  // 独角狮硬角
Array(4000074, 50, 200010302),  // 黑色飞狮尾
Array(4000058, 50, 200030000), //  食人花的种子
Array(4000059, 50, 200020000), //  星光精灵的星块
Array(4000060, 50, 200040000), //  月光精灵的月块
Array(4000061, 50, 200070000), //  日光精灵的日块
Array(4000062, 50, 200060000), //  黑食人花的种子
//冰封雪域
Array(4000048, 50, 211010000),  // 小白雪人皮
Array(4000049, 50, 211040500),  // 白雪人角
Array(4000050, 50, 211030000),  // 企鹅王的嘴
Array(4000051, 50, 211050000), //  野狼之尾
Array(4000052, 50, 211040200), //  白狼之尾
Array(4000053, 50, 211040700), //  狼人脚趾甲
Array(4000054, 50, 211041000), //  白狼人脚趾甲
Array(4000055, 50, 211020000), //  小黑雪人皮
Array(4000056, 50, 211040600), //  黑雪人的角
Array(4000057, 50, 211040000), //  黑企鹅王的嘴
Array(4000076, 50, 211041900),  // 独眼蝙蝠之翼
Array(4000078, 50, 211042000),  // 小猎犬的尖牙
Array(4000079, 50, 211042100),  // 猎犬的尖牙
Array(4000080, 50, 211042200),  // 火焰猎犬的项链
Array(4000082, 50, 211041700),  // 僵尸丢失的金齿
Array(4000083, 50, 200080200),  // 小石球的石片
Array(4000084, 50, 200081000),  // 冰石球的石片
Array(4000085, 50, 200080900),  // 火石球的石片
Array(4000086, 50, 200081300),  // 小白雪鬼的毛团
Array(4000087, 50, 200081700),  // 小黑雪鬼的毛团
Array(4000088, 50, 211000200),  // 小企鹅王的鱼
//玩具城
Array(4000095, 50, 221023200),  // 老鼠陷阱
Array(4000096, 50, 221022900),  // 硬胡桃
Array(4000097, 50, 221022600),  // 很精细的蜘蛛网
Array(4000098, 50, 221022500),  // 粘糊糊的蜘蛛网
Array(4000099, 50, 221021300),  // 章鱼钥匙装饰品
Array(4000100, 50, 221021200),  // 玩具王冠
Array(4000101, 50, 221020400),  // 黄色玩具圈
Array(4000102, 50, 221020200),  // 蓝色玩具圈
Array(4000103, 50, 221021500),  // 飞机推进器
Array(4000106, 50, 220010500),  // 玩具熊猫的棉花团
Array(4000107, 50, 220010300),  // 玩具熊猫的黄色丝带
Array(4000108, 50, 220010900),  // 熊猫娃娃
Array(4000109, 50, 220010800),  // 玩具小鸭
Array(4000110, 50, 220011000),  // 木马骑兵的剑
Array(4000111, 50, 220020400),  // 便宜的电池
Array(4000112, 50, 220030300),  // 机器心脏
Array(4000113, 50, 220040200),  // 表配件
Array(4000114, 50, 220050100),  // 小桌表
Array(4000115, 50, 220040300),  // 齿轮
Array(4000117, 50, 221040000),  // 太空食品
Array(4000118, 50, 221040200),  // 外星人的太空船缩小的
Array(4000119, 50, 221040400),  // 收报机
Array(4000120, 50, 221030100),  // 外星章鱼的触角
Array(4000121, 50, 221030500), // 外星章鱼的头盔
Array(4000122, 50, 221030600), //  外星章鱼的光线枪
Array(4000119, 50, 221040400), //  白外星人司令的标志
Array(4000127, 50, 221021700), //  玩具鼓
Array(4000128, 50, 220060000), //  黄小丑的帽子
Array(4000129, 50, 220060000) // 红小丑之珠
);

var 难度100材料 = Array(
//天空之城
Array(4000069, 50, 211041100),  // 僵尸丢失的臼齿
Array(4000070, 50, 200010111),  // 红独角狮的尾
Array(4000071, 50, 200010121),  // 黄独角狮尾
Array(4000072, 50, 200010131),  // 蓝独角狮的尾
Array(4000073, 50, 200010110),  // 独角狮硬角
Array(4000074, 50, 200010302),  // 黑色飞狮尾
Array(4000058, 50, 200030000), //  食人花的种子
Array(4000059, 50, 200020000), //  星光精灵的星块
Array(4000060, 50, 200040000), //  月光精灵的月块
Array(4000061, 50, 200070000), //  日光精灵的日块
Array(4000062, 50, 200060000), //  黑食人花的种子
//冰封雪域
Array(4000049, 50, 211040500),  // 白雪人角
Array(4000050, 50, 211030000),  // 企鹅王的嘴
Array(4000051, 50, 211050000), //  野狼之尾
Array(4000052, 50, 211040200), //  白狼之尾
Array(4000053, 50, 211040700), //  狼人脚趾甲
Array(4000054, 50, 211041000), //  白狼人脚趾甲
Array(4000055, 50, 211020000), //  小黑雪人皮
Array(4000056, 50, 211040600), //  黑雪人的角
Array(4000057, 50, 211040000), //  黑企鹅王的嘴
Array(4000076, 50, 211041900),  // 独眼蝙蝠之翼
Array(4000078, 50, 211042000),  // 小猎犬的尖牙
Array(4000079, 50, 211042100),  // 猎犬的尖牙
Array(4000080, 50, 211042200),  // 火焰猎犬的项链
Array(4000082, 50, 211041700),  // 僵尸丢失的金齿
//海底世界
Array(4000179, 50, 230040200), //  刺鳍鱼串
Array(4000180, 50, 230040400), //  鲨鱼假牙
Array(4000181, 50, 230040400), //   冷冻鱼翅
Array(4000182, 50, 230040100), //   石灰粉瓶
Array(4000183, 50, 230040300), //  墨汁瓶
Array(4000184, 50, 230040300), //  奶油烤章鱼
Array(4000153, 50, 230010000), //  潜水镜组
Array(4000154, 50, 230010000), //  小海豹玩偶
Array(4000155, 50, 230010300), //  海狮皮革
Array(4000156, 50, 230010300), //  海象尖牙
Array(4000157, 50, 230010300), //  海豹肉
Array(4000164, 50, 230020300), //  蓝泡泡翻车鱼之心
Array(4000165, 50, 230020300), //  华丽的花瓣
Array(4000166, 50, 230020100), //  虾肉
Array(4000167, 50, 230020000),  // 胖球鱼身上的坚硬鳞片
Array(4000168, 50, 222020100),  // 水老鼠爱吃的向日葵瓜子
Array(4000169, 50, 222010001),  // 月妙的捣米棒，用来捣碎杂物
Array(4000170, 50, 222010101),  // 老虎脚印
Array(4000171, 50, 222010200), //  虎皮
Array(4000172, 50, 222010300), //  三尾狐的尾巴
//玩具城
Array(4000095, 50, 221023200),  // 老鼠陷阱
Array(4000096, 50, 221022900),  // 硬胡桃
Array(4000097, 50, 221022600),  // 很精细的蜘蛛网
Array(4000098, 50, 221022500),  // 粘糊糊的蜘蛛网
Array(4000099, 50, 221021300),  // 章鱼钥匙装饰品
Array(4000100, 50, 221021200),  // 玩具王冠
Array(4000101, 50, 221020400),  // 黄色玩具圈
Array(4000102, 50, 221020200),  // 蓝色玩具圈
Array(4000103, 50, 221021500),  // 飞机推进器
Array(4000106, 50, 220010500),  // 玩具熊猫的棉花团
Array(4000107, 50, 220010300),  // 玩具熊猫的黄色丝带
Array(4000108, 50, 220010900),  // 熊猫娃娃
Array(4000109, 50, 220010800),  // 玩具小鸭
Array(4000110, 50, 220011000),  // 木马骑兵的剑
Array(4000111, 50, 220020400),  // 便宜的电池
Array(4000112, 50, 220030300),  // 机器心脏
Array(4000113, 50, 220040200),  // 表配件
Array(4000114, 50, 220050100),  // 小桌表
Array(4000115, 50, 220040300),  // 齿轮
Array(4000117, 50, 221040000),  // 太空食品
Array(4000118, 50, 221040200),  // 外星人的太空船缩小的
Array(4000119, 50, 221040400),  // 收报机
Array(4000120, 50, 221030100),  // 外星章鱼的触角
Array(4000121, 50, 221030500), // 外星章鱼的头盔
Array(4000122, 50, 221030600), //  外星章鱼的光线枪
Array(4000119, 50, 221040400), //  白外星人司令的标志
Array(4000127, 50, 221021700), //  玩具鼓
Array(4000128, 50, 220060000), //  黄小丑的帽子
Array(4000129, 50, 220060000), // 红小丑之珠
Array(4000130, 50, 220060100), //  时之鬼兵的挂钟
Array(4000131, 50, 220060100),  // 时之鬼将带的石片。看起来挺重。
Array(4000132, 50, 220060200), //  蓝帽海贼的舵
Array(4000134, 50, 220060300), //  大海贼的帆
Array(4000135, 50, 220060301), //  大海贼王的帽子
Array(4000143, 50, 220070000), //  僵尸娃娃
Array(4000144, 50, 220070000), //  自由灵魂
Array(4000145, 50, 220070100), //  被封印的挂钟
Array(4000146, 50, 220070100), //  死恶的灵魂
Array(4000147, 50, 220070200), //  被封印的僵尸娃娃
Array(4000148, 50, 220070201), //  束缚之手
Array(4000149, 50, 220070300), //  被封印的缸子
Array(4000150, 50, 220070301),  // 时间鬼王的冰块
// 神木村
Array(4000274, 50, 240040511),  // 原本在骷髅龙头顶上而断裂的角
Array(4000273, 50, 240040511),  // 组成骷髅龙长老身体的老旧颈骨
Array(4000268, 50, 240040400),  // 红飞龙翅膀
Array(4000269, 50, 240040400),  // 蓝飞龙翅膀
Array(4000270, 50, 240040400),  // 蓝飞龙翅膀
Array(4000232, 50, 240020500),  // 半人马的火花
Array(4000233, 50, 240020500),  // 半人马的净水
Array(4000265, 50, 240030300),  // 龙林3
Array(4000264, 50, 954030200),  // 龙林2
Array(4000267, 50, 240030102),  // 消失的树林
Array(4000266, 50, 240030101),  // 火焰树林
Array(4000263, 50, 240030100)  // 龙林1
);

var 难度150材料 = Array(
// 玩具城
Array(4000130, 50, 220060100), //  时之鬼兵的挂钟
Array(4000131, 50, 220060100),  // 时之鬼将带的石片。看起来挺重。
Array(4000132, 50, 220060200), //  蓝帽海贼的舵
Array(4000134, 50, 220060300), //  大海贼的帆
Array(4000135, 50, 220060301), //  大海贼王的帽子
Array(4000143, 50, 220070000), //  僵尸娃娃
Array(4000144, 50, 220070000), //  自由灵魂
Array(4000145, 50, 220070100), //  被封印的挂钟
Array(4000146, 50, 220070100), //  死恶的灵魂
Array(4000147, 50, 220070200), //  被封印的僵尸娃娃
Array(4000148, 50, 220070201), //  束缚之手
Array(4000149, 50, 220070300), //  被封印的缸子
Array(4000150, 50, 220070301),  // 时间鬼王的冰块
// 圣地
Array(4000645, 50, 271010301),  // 变异的漂漂猪脖子肉
Array(4000644, 50, 271010301),  // 变异的绿水灵珠
Array(4000648, 50, 271000210),  // 变异的提古尔羽毛
Array(4000643, 50, 271020000),  // 变异的蘑菇盖
// 时间神殿
Array(4000457, 50, 270030300),  // 忘却的守护兵带着的头盔
Array(4000458, 50, 270030500),  // 忘却的守护队长的心脏
Array(4000453, 50, 270020400),  // 后悔的守护队长的心脏
Array(4000452, 50, 270020300),  // 后悔的守护兵带着的头盔
Array(4000449, 50, 270020100),  // 后悔的祭司穿着的衣服的一部分
// 神木村
Array(4000274, 50, 240040511),  // 原本在骷髅龙头顶上而断裂的角
Array(4000273, 50, 240040511),  // 组成骷髅龙长老身体的老旧颈骨
Array(4000268, 50, 240040400),  // 红飞龙翅膀
Array(4000269, 50, 240040400),  // 蓝飞龙翅膀
Array(4000270, 50, 240040400),  // 蓝飞龙翅膀
Array(4000232, 50, 240020500),  // 半人马的火花
Array(4000233, 50, 240020500),  // 半人马的净水
Array(4000265, 50, 240030300),  // 龙林3
Array(4000264, 50, 954030200),  // 龙林2
Array(4000263, 50, 240030100),  // 龙林1
Array(4000267, 50, 240030102),  // 消失的树林
Array(4000266, 50, 240030101),  // 火焰树林
// 冰封雪域
Array(4000076, 50, 211041900),  // 独眼蝙蝠之翼
Array(4000078, 50, 211042000),  // 小猎犬的尖牙
Array(4000079, 50, 211042100),  // 猎犬的尖牙
Array(4000080, 50, 211042200),  // 火焰猎犬的项链
Array(4000082, 50, 211041700),  // 僵尸丢失的金齿
Array(4000053, 50, 211040700), //  狼人脚趾甲
Array(4000054, 50, 211041000), //  白狼人脚趾甲
// 外星人
Array(4000120, 50, 221030100),  // 外星章鱼的触角
Array(4000121, 50, 221030500), // 外星章鱼的头盔
Array(4000122, 50, 221030600), //  外星章鱼的光线枪
Array(4000119, 50, 221040400), //  白外星人司令的标志
// 海底世界
Array(4000179, 50, 230040200), //  刺鳍鱼串
Array(4000180, 50, 230040400), //  鲨鱼假牙
Array(4000181, 50, 230040400), //   冷冻鱼翅
Array(4000182, 50, 230040100), //   石灰粉瓶
Array(4000183, 50, 230040300) //  墨汁瓶
);

var 难度200材料 = Array(
// 圣地
Array(4000645, 50, 271010301),  // 变异的漂漂猪脖子肉
Array(4000644, 50, 271010301),  // 变异的绿水灵珠
Array(4000648, 50, 271000210),  // 变异的提古尔羽毛
Array(4000643, 50, 271020000),  // 变异的蘑菇盖
// 时间神殿
Array(4000458, 50, 270030500),  // 忘却的守护队长的心脏
Array(4000457, 50, 270030300),  // 忘却的守护兵带着的头盔
Array(4000453, 50, 270020400),  // 后悔的守护队长的心脏
Array(4000452, 50, 270020300),  // 后悔的守护兵带着的头盔
Array(4000449, 50, 270020100),  // 后悔的祭司穿着的衣服的一部分
// 神木村
Array(4000274, 50, 240040511),  // 原本在骷髅龙头顶上而断裂的角
Array(4000273, 50, 240040511),  // 组成骷髅龙长老身体的老旧颈骨
// 玩具城
Array(4000150, 50, 220070301),  // 时间鬼王的冰块
Array(4000134, 50, 220060300), //  大海贼的帆
// 冰封雪域
Array(4000080, 50, 211042200),  // 火焰猎犬的项链
Array(4000082, 50, 211041700),  // 僵尸丢失的金齿
Array(4000053, 50, 211040700), //  狼人脚趾甲
Array(4000054, 50, 211041000), //  白狼人脚趾甲
// 外星人
Array(4000119, 50, 221040400), //  白外星人司令的标志
// 海底世界
Array(4000180, 50, 230040400), //  鲨鱼假牙
Array(4000181, 50, 230040400), //   冷冻鱼翅
// 狮子王城
Array(4000629, 50, 211060830), //  石头人
Array(4000628, 50, 211060410), //  秃鹰
Array(4000627, 50, 211060700), //  贝尔夫
Array(4000626, 50, 211060300), //  麋鹿
Array(4000625, 50, 211060100) //   鳄鱼
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 0) {
			cm.openNpc(9900004,"每日任务");
            cm.dispose();
            return;
        }
        if (mode == 1) status++;
        if (status == 0) {
			获取任务完成次数 = cm.getBossRank9("每日材料完成"+获取日期+"", 2);
			获取任务开始次数 = cm.getBossRank9("每日材料开始"+获取日期+"", 2);
			拥有积分 = cm.getBossRank9("今日积分"+获取日期+"", 2);
			当前难度 = cm.getBossRank9("每日金币任务难度", 2);
			if (cm.getBossLog("每日任务重置" + 获取日期) == 0) {
			cm.setBossLog("每日任务重置" + 获取日期);
			cm.setBossRankCount9("每日材料开始"+获取日期+"",0);
			cm.setBossRankCount9("每日材料完成"+获取日期+"",0);
			cm.setBossRankCount9("今日积分"+获取日期+"",0);
			if (当前难度 < 50){
			cm.setBossRankCount9("每日金币任务难度",任务难度升级[0]);
			}
			cm.sendOk("#b每日任务已重置 请重新打开NPC");
			cm.dispose();
			return;
			}
			if (cm.getBossRank9("每日金币任务难度", 2) >= 50 && cm.getBossRank9("每日金币任务难度", 2) < 100) {
					完成任务[1][2] = 10*10000;//简单完成金币
					完成任务[1][3] = 1;//简单完成积分
					完成任务[2][2] = 20*10000;//普通完成金币
					完成任务[2][3] = 3;//普通完成积分
					完成任务[3][2] = 30*10000;//完全完成金币
					完成任务[3][3] = 5;//完全完成积分
					完成任务[4][2] = 50*10000;//超额完成金币
					完成任务[4][3] = 10;//超额完成积分
					所有材料文本 = 难度50材料;
					积分宝箱奖励金币 = 3000000; // 900W + 500W
			} else if (cm.getBossRank9("每日金币任务难度", 2) >= 100 && cm.getBossRank9("每日金币任务难度", 2) < 150) { 
					完成任务[1][2] = 50*10000;//简单完成金币
					完成任务[1][3] = 3;//简单完成积分
					完成任务[2][2] = 100*10000;//普通完成金币
					完成任务[2][3] = 5;//普通完成积分
					完成任务[3][2] = 200*10000;//完全完成金币
					完成任务[3][3] = 10;//完全完成积分
					完成任务[4][2] = 300*10000;//超额完成金币
					完成任务[4][3] = 15;//超额完成积分
					积分宝箱奖励金币 = 5000000; // 3000W+1800w
					所有材料文本 = 难度100材料;
			} else if (cm.getBossRank9("每日金币任务难度", 2) >= 150 && cm.getBossRank9("每日金币任务难度", 2) < 200) { 
					完成任务[1][2] = 100*10000;//简单完成金币
					完成任务[1][3] = 5;//简单完成积分
					完成任务[2][2] = 200*10000;//普通完成金币
					完成任务[2][3] = 10;//普通完成积分
					完成任务[3][2] = 300*10000;//完全完成金币
					完成任务[3][3] = 15;//完全完成积分
					完成任务[4][2] = 500*10000;//超额完成金币
					完成任务[4][3] = 20;//超额完成积分
					积分宝箱奖励金币 = 5000000; // 5000W + 5000W
					所有材料文本 = 难度150材料;
			} else if (cm.getBossRank9("每日金币任务难度", 2) >= 200 && cm.getBossRank9("每日金币任务难度", 2) < 235) { 
					完成任务[1][2] = 200*10000;//简单完成金币
					完成任务[1][3] = 10;//简单完成积分
					完成任务[2][2] = 300*10000;//普通完成金币
					完成任务[2][3] = 15;//普通完成积分
					完成任务[3][2] = 500*10000;//完全完成金币
					完成任务[3][3] = 20;//完全完成积分
					完成任务[4][2] = 1000*10000;//超额完成金币
					完成任务[4][3] = 25;//超额完成积分
					积分宝箱奖励金币 = 10000000; // 1亿 + 1亿
					所有材料文本 = 难度200材料;
			} else if (cm.getBossRank9("每日金币任务难度", 2) >= 235) { 
					完成任务[1][2] = 500*10000;//简单完成金币
					完成任务[1][3] = 15;//简单完成积分
					完成任务[2][2] = 1000*10000;//普通完成金币
					完成任务[2][3] = 20;//普通完成积分
					完成任务[3][2] = 1500*10000;//完全完成金币
					完成任务[3][3] = 25;//完全完成积分
					完成任务[4][2] = 2000*10000;//超额完成金币
					完成任务[4][3] = 30;//超额完成积分
					所有材料文本 = 难度200材料;
					积分宝箱奖励金币 = 12500000; // 2亿+ 2亿
			}
			if (获取任务开始次数 == 获取任务完成次数 && 获取任务完成次数 < 每日可完成次数) {
            text = "\t\t\t #v4031432##e#r【每日金币任务】#v4031432##n#k\r\n\r\n";
			text += "               #d今日还可完成数：#r" + (每日可完成次数-获取任务完成次数) + "/#r" + 每日可完成次数 + "#k 次\r\n";
			}
			if (获取任务开始次数 != 获取任务完成次数) {
			text += "#v4032351##d#e当前#r任务内容：#n\r\n\r\n";
			text += "  #d收集#v"+cm.getBossRank9("第"+获取任务开始次数+"环"+获取日期+"", 2)+"##b#z"+cm.getBossRank9("第"+获取任务开始次数+"环"+获取日期+"", 2)+"# #d背包拥有:"+cm.itemQuantity(cm.getBossRank9("第"+获取任务开始次数+"环"+获取日期+"", 2))+"个\r\n";
			text += "  #d任务材料收集越多 #r积分 #r奖励 #d#l#d也会#b随之增多\r\n";
			text += "  #k#e当前奖励阶段:#B" + (当前难度/235*100) + "# #n"+当前难度+"/235\r\n";
			text += "  #d#e简单完成#n:#d收集数量:"+完成任务[1][1]+" #r奖励:#d金币"+完成任务[1][2]/10000+"W 积分"+完成任务[1][3]+"\r\n";
			text += "  #g#e普通完成#n:#d收集数量:"+完成任务[2][1]+" #r奖励:#d金币"+完成任务[2][2]/10000+"W 积分"+完成任务[2][3]+"\r\n";
			text += "  #b#e完全完成#n:#d收集数量:"+完成任务[3][1]+" #r奖励:#d金币"+完成任务[3][2]/10000+"W 积分"+完成任务[3][3]+"\r\n";
			text += "  #r#e超额完成#n:#d收集数量:"+完成任务[4][1]+" #r奖励:#d金币"+完成任务[4][2]/10000+"W 积分"+完成任务[4][3]+"\r\n";
			text += "  #r#e积分箱子有大量金币，双倍经验药水，双倍爆率药水，双倍金币爆率药水\r\n";
			text += "  #r#e最后300积分箱子10000点券，20000抵用\r\n";
			text += "  #d今日还可完成数：#r" + (每日可完成次数-获取任务完成次数) + "/#r" + 每日可完成次数 + "#k 次\r\n";
			}
			if (获取任务开始次数 == 获取任务完成次数 && 获取任务完成次数 < 每日可完成次数) {
			text += "                #k#L1##e#r#b#v4031572#接取任务#d#l#k\r\n ";
			}
			if (获取任务完成次数 == 每日可完成次数) {
			text += "          #k#L3##e#d已完成今日所有收集任务#d#l#k\r\n ";
			}	
			if (获取任务开始次数 != 获取任务完成次数) {
			text += "   #L2##e#r#k#v4000299##d简单#k完成#d#l#k";
			text += "      #L21##e#r#g#v4031474#普通#k完成#d#l#k\r\n";
			text += "   #L22##e#r#b#v4161046#完全#k完成#d#l#k";
			text += "     #L23##e#r#r#v4031573#超额#k完成#d#l#k\r\n\r\n";
			}
			if (获取任务开始次数 != 获取任务完成次数) {
			text += "      #L4##e#r#v4031839#放弃当前任务，需要6000点券#d#l#k\r\n\r\n ";
			text += "         #L5##d传送至#r任务物品#d掉落地图#d#l#k \r\n \r\n";
			}
			text += "\r\n#n      #d当前任务积分:#B" + (拥有积分/满积分*100) + "# "+拥有积分+"/"+满积分+"积分\r\n";
			text += "#b#L"+积分宝箱[0]+"#"+积分宝箱[0]+"#v4001102##l";
			text += "#b#L"+积分宝箱[1]+"#"+积分宝箱[1]+"#v4001102##l";
			text += "#b#L"+积分宝箱[2]+"#"+积分宝箱[2]+"#v4001102##l";
			text += "#b#L"+积分宝箱[3]+"#"+积分宝箱[3]+"#v4001102##l";
			text += "#b#L"+积分宝箱[5]+"#"+积分宝箱[5]+"#v4001102##l\r\n";
			if (获取任务开始次数 == 获取任务完成次数 && 获取任务完成次数 < 每日可完成次数) {
			text += "\r\n#n      #d当前奖励阶段:#B" + (当前难度/235*100) + "# "+当前难度+"/235阶段\r\n";
			text += "  #r#e#L235##v4032351#解锁更高奖励，需要2000点券#v4032351##l\r\n";
			}
			cm.sendSimple(text);
			} else if (status == 1) {
			if (selection == 1) {			// 接受任务
				var 随机获取代码 = Math.floor(Math.random()*所有材料文本.length);
				任务所需道具 = 所有材料文本[随机获取代码][0];	// 任务道具ID
				text = "\r\n\r\n#e第#r" + (获取任务完成次数 + 1) + "#k环：#n\r\n\r\n请帮我收集#r#z" + 任务所需道具 + "##v" + 任务所需道具 + "##k\r\n可重新打开#r任务NPC #d传送至物品掉落地图\r\n#k感激不尽，快去快回~";
				for (var i = 0; i <= (每日可完成次数-1); i++) {
				if (获取任务完成次数 == i) {
				cm.setBossRankCount9("第"+(i+1)+"环"+获取日期+"",+任务所需道具);
				cm.setBossRankCount9("每日材料开始"+获取日期+"",+1);
				}
				}
				cm.sendOk(text);
				cm.dispose();
			} else if (selection == 2) {			// 简单完成
			  if(cm.getMeso()+完成任务[1][2] > 2100000000){
                cm.sendOk("#b提交失败 当前背包金币过多,请先存银行");
                cm.dispose();
                return;
            }
				for (var i = 0; i <= 每日可完成次数; i++) {
				if (获取任务开始次数 == i) {
				var 完成任务需要的材料代码 = cm.getBossRank9("第"+i+"环"+获取日期+"", 2);
				if (cm.itemQuantity(完成任务需要的材料代码) >= 完成任务[1][1]) {
				cm.gainItem(完成任务需要的材料代码, -完成任务[1][1]);
				cm.setBossRankCount9("每日材料完成"+获取日期+"",1);
				cm.gainMeso(完成任务[1][2]); //金币
				cm.setBossRankCount9("今日积分"+获取日期+"",完成任务[1][3]); //积分
				cm.playerMessage("任务完成 金币 (+"+完成任务[1][2]+")");
				cm.playerMessage("任务完成 积分 (+"+完成任务[1][3]+")");
				var 升级所需经验 = cm.getPlayer().getNeededExp();
				cm.gainExp((升级所需经验 / 100) *10);
				cm.getPlayer().dropMessage(1, "任务完成");
				cm.dispose();
				} else {
				cm.sendOk("#d简单完成需要#v"+完成任务需要的材料代码+"##b#z"+完成任务需要的材料代码+"#"+完成任务[1][1]+"个 #k材料不足...");
				cm.dispose();
					}
				}
				}
			} else if (selection == 21) {			// 普通完成
			  if(cm.getMeso()+完成任务[2][2] > 2100000000){
                cm.sendOk("#b提交失败 当前背包金币过多,请先存银行");
                cm.dispose();
                return;
            }
				for (var i = 0; i <= 每日可完成次数; i++) {
				if (获取任务开始次数 == i) {
				var 完成任务需要的材料代码 = cm.getBossRank9("第"+i+"环"+获取日期+"", 2);
				if (cm.itemQuantity(完成任务需要的材料代码) >= 完成任务[2][1]) {
				cm.gainItem(完成任务需要的材料代码, -完成任务[2][1]);
				cm.setBossRankCount9("每日材料完成"+获取日期+"",1);
				cm.gainMeso(完成任务[2][2]); //金币
				cm.setBossRankCount9("今日积分"+获取日期+"",完成任务[2][3]); //积分
				cm.playerMessage("任务完成 金币 (+"+完成任务[2][2]+")");
				cm.playerMessage("任务完成 积分 (+"+完成任务[2][3]+")");
				var 升级所需经验 = cm.getPlayer().getNeededExp();
				cm.gainExp((升级所需经验 / 100) *20);
				cm.getPlayer().dropMessage(1, "任务完成");
				cm.dispose();
				} else {
				cm.sendOk("#d普通完成需要#v"+完成任务需要的材料代码+"##b#z"+完成任务需要的材料代码+"#"+完成任务[2][1]+"个 #k材料不足...");
				cm.dispose();
					}
				}
				}
			} else if (selection == 22) {			// 完全完成
			  if(cm.getMeso()+完成任务[3][2] > 2100000000){
                cm.sendOk("#b提交失败 当前背包金币过多,请先存银行");
                cm.dispose();
                return;
            }
				for (var i = 0; i <= 每日可完成次数; i++) {
				if (获取任务开始次数 == i) {
				var 完成任务需要的材料代码 = cm.getBossRank9("第"+i+"环"+获取日期+"", 2);
				if (cm.itemQuantity(完成任务需要的材料代码) >= 完成任务[3][1]) {
				cm.gainItem(完成任务需要的材料代码, -完成任务[3][1]);
				cm.setBossRankCount9("每日材料完成"+获取日期+"",1);
				cm.gainMeso(完成任务[3][2]); //金币
				cm.setBossRankCount9("今日积分"+获取日期+"",完成任务[3][3]); //积分
				cm.playerMessage("任务完成 金币 (+"+完成任务[3][2]+")");
				cm.playerMessage("任务完成 积分 (+"+完成任务[3][3]+")");
				var 升级所需经验 = cm.getPlayer().getNeededExp();
				cm.gainExp((升级所需经验 / 100) *30);
				cm.getPlayer().dropMessage(1, "任务完成");
				cm.dispose();
				} else {
				cm.sendOk("#d完全完成需要#v"+完成任务需要的材料代码+"##b#z"+完成任务需要的材料代码+"#"+完成任务[3][1]+"个 #k材料不足...");
				cm.dispose();
					}
				}
				}
			} else if (selection == 23) {			// 超额完成
			  if(cm.getMeso()+完成任务[4][2] > 2100000000){
                cm.sendOk("#b提交失败 当前背包金币过多,请先存银行");
                cm.dispose();
                return;
            }
				for (var i = 0; i <= 每日可完成次数; i++) {
				if (获取任务开始次数 == i) {
				var 完成任务需要的材料代码 = cm.getBossRank9("第"+i+"环"+获取日期+"", 2);
				if (cm.itemQuantity(完成任务需要的材料代码) >= 完成任务[4][1]) {
				cm.gainItem(完成任务需要的材料代码, -完成任务[4][1]);
				cm.setBossRankCount9("每日材料完成"+获取日期+"",1);
				cm.gainMeso(完成任务[4][2]); //金币
				cm.setBossRankCount9("今日积分"+获取日期+"",完成任务[4][3]); //积分
				cm.playerMessage("任务完成 金币 (+"+完成任务[4][2]+")");
				cm.playerMessage("任务完成 积分 (+"+完成任务[4][3]+")");
				var 升级所需经验 = cm.getPlayer().getNeededExp();
				cm.gainExp((升级所需经验 / 100) *40);
				cm.getPlayer().dropMessage(1, "任务完成");
				cm.dispose();
				} else {
				cm.sendOk("#d超额完成需要#v"+完成任务需要的材料代码+"##b#z"+完成任务需要的材料代码+"#"+完成任务[4][1]+"个 #k材料不足...");
				cm.dispose();
					}
				}
				}
			} else if (selection == 3) {			// 今日全部完成 关闭窗口
				cm.dispose();
			} else if (selection == 4) {			// 放弃当前任务 重置
				if (cm.getPlayer().getCSPoints(1) > 6000){
		        		cm.gainNX(-6000);
				cm.setBossRankCount9("每日材料完成"+获取日期+"",1);
				cm.sendOk("#b任务已重置，请重新接取...");
				cm.dispose();}
				else {
				                cm.sendOk("你的点卷不足10000.");
				                cm.dispose();
				            }
			} else if (selection == 235) {// 解锁更高奖励
			var 等级 = cm.getPlayer().getLevel();
			if(当前难度 == 任务难度升级[0]){
			if(等级 >= 任务难度升级[1] || cm.getPlayer().getTotalWins() >= 1){
				if (cm.getPlayer().getCSPoints(1) > 2000){
					cm.gainNX(-2000);
					cm.setBossRankCount9("每日金币任务难度",-当前难度+任务难度升级[1]);
					cm.sendOk("#b升级奖励阶段成功\r\n#k当前奖励阶段:#B" + (任务难度升级[1]/235*100) + "# #n"+任务难度升级[1]+"/235阶段...");
					cm.dispose();}
			else {
			cm.sendOk("你的点券不足.");
			cm.dispose();
		}
			} else {
			cm.sendOk("#k当前奖励阶段:#B" + (当前难度/235*100) + "# #n"+当前难度+"/235阶段\r\n#d下一阶段解锁需要#b人物等级#d达到 #r"+任务难度升级[1]+"级 #d才能解锁...");
			cm.dispose();
			}
			} else if(当前难度 == 任务难度升级[1]){
				if(等级 >= 任务难度升级[2] || cm.getPlayer().getTotalWins() >= 1){
					if (cm.getPlayer().getCSPoints(1) > 20000){
					cm.gainNX(-20000);
			cm.setBossRankCount9("每日金币任务难度",-当前难度+任务难度升级[2]);
			cm.sendOk("#b升级奖励阶段成功\r\n#k当前奖励阶段:#B" + (任务难度升级[2]/235*100) + "# #n"+任务难度升级[2]+"/235阶段...");
			cm.dispose();}
			else {
			cm.sendOk("你的点券不足.");
			cm.dispose();
		}
			} else {
			cm.sendOk("#k当前奖励阶段:#B" + (当前难度/235*100) + "# #n"+当前难度+"/235阶段\r\n#d下一阶段解锁需要#b人物等级#d达到 #r"+任务难度升级[2]+"级 #d才能解锁...");
			cm.dispose();
			}
			} else if(当前难度 == 任务难度升级[2]){
				if(等级 >= 任务难度升级[3] || cm.getPlayer().getTotalWins() >= 1){
					if (cm.getPlayer().getCSPoints(1) > 20000){
					cm.gainNX(-20000);
			cm.setBossRankCount9("每日金币任务难度",-当前难度+任务难度升级[3]);
			cm.sendOk("#b升级奖励阶段成功\r\n#k当前奖励阶段:#B" + (任务难度升级[3]/235*100) + "# #n"+任务难度升级[3]+"/235阶段...");
			cm.dispose();}
			else {
			cm.sendOk("你的点券不足.");
			cm.dispose();
		}
			} else {
			cm.sendOk("#k当前奖励阶段:#B" + (当前难度/235*100) + "# #n"+当前难度+"/235阶段\r\n#d下一阶段解锁需要#b人物等级#d达到 #r"+任务难度升级[3]+"级 #d才能解锁...");
			cm.dispose();
			}
			} else if(当前难度 == 任务难度升级[3]){
				if(等级 >= 任务难度升级[4] || cm.getPlayer().getTotalWins() >= 1){
					if (cm.getPlayer().getCSPoints(1) > 20000){
					cm.gainNX(-20000);
			cm.setBossRankCount9("每日金币任务难度",-当前难度+任务难度升级[4]);
			cm.sendOk("#b升级奖励阶段成功\r\n#k当前奖励阶段:#B" + (任务难度升级[4]/235*100) + "# #n"+任务难度升级[4]+"/235阶段...");
			cm.dispose();}
			else {
			cm.sendOk("你的点券不足.");
			cm.dispose();
		}
			} else {
			cm.sendOk("#k当前奖励阶段:#B" + (当前难度/235*100) + "# #n"+当前难度+"/235阶段\r\n#d下一阶段解锁需要#b人物等级#d达到 #r"+任务难度升级[4]+"级 #d才能解锁...");
			cm.dispose();
			}
			} else if(当前难度 == 任务难度升级[4]){
			cm.sendOk("#b奖励#r已满阶 #b无法继续提升\r\n#k当前奖励阶段:#B" + (任务难度升级[4]/235*100) + "# #n"+任务难度升级[4]+"/235阶段...");
			cm.dispose();
			}
			} else if (selection == 5) {			// 传送至物品掉落地图
				for (var i = 0; i <= 每日可完成次数; i++) {
				if (获取任务开始次数 == i) {
				var 完成任务需要的材料代码 = cm.getBossRank9("第"+i+"环"+获取日期+"", 2);
                        var selStr = "系统会根据你所接取的任务,自动帮你匹配地图.#b";
				for (var o = 0; o < 所有材料文本.length; o++) {						
				if (所有材料文本[o][0] == 完成任务需要的材料代码) {	
				selStr += "\r\n#b#L" + o + "##m" + 所有材料文本[o][2] + "# #r需花费3000点券";
				}
				}
				}
			}
                        cm.sendSimple(selStr);
                        towns = 1;
            } else if (selection == 积分宝箱[0]) {// 50积分宝箱
			if (cm.getMeso()+积分宝箱奖励金币 > 2100000000) {
			    cm.sendOk("背包金币过多, 请先存银行...");
                cm.dispose();
                return;
			}
			if (cm.getBossLog(""+积分宝箱[0]+"积分宝箱领取" + 获取日期) == 1) {
			    cm.sendOk("今天已经领取过了...");
                cm.dispose();
                return;
			}
			if (拥有积分 < 积分宝箱[0]) {
                cm.sendOk("积分不足...");
                cm.dispose();
                return;
            }
				cm.gainMeso(积分宝箱奖励金币); //金币
				cm.gainItem(2450022,1);
                cm.gainItem(2022709,1);
                cm.gainItem(2022124,1);
				cm.setBossLog(""+积分宝箱[0]+"积分宝箱领取" + 获取日期);
                cm.sendOk("#k领取成功, 奖励"+积分宝箱奖励金币*1+"金币...");
			cm.dispose();
            } else if (selection == 积分宝箱[1]) {// 100积分宝箱
			if (cm.getMeso()+积分宝箱奖励金币*2 > 2100000000) {
			    cm.sendOk("背包金币过多, 请先存银行...");
                cm.dispose();
                return;
			}
			if (cm.getBossLog(""+积分宝箱[1]+"积分宝箱领取" + 获取日期) == 1) {
			    cm.sendOk("今天已经领取过了...");
                cm.dispose();
                return;
			}
			if (拥有积分 < 积分宝箱[1]) {
                cm.sendOk("积分不足...");
                cm.dispose();
                return;
            }
				cm.gainMeso(积分宝箱奖励金币*2); //金币
				cm.gainItem(2450022,1);
                cm.gainItem(2022709,1);
                cm.gainItem(2022124,1);
				cm.setBossLog(""+积分宝箱[1]+"积分宝箱领取" + 获取日期);
                cm.sendOk("#k领取成功, 奖励"+积分宝箱奖励金币*2+"金币...");
			cm.dispose();
            } else if (selection == 积分宝箱[2]) {// 150积分宝箱
			if (cm.getMeso()+积分宝箱奖励金币*3 > 2100000000) {
			    cm.sendOk("背包金币过多, 请先存银行...");
                cm.dispose();
                return;
			}
			if (cm.getBossLog(""+积分宝箱[2]+"积分宝箱领取" + 获取日期) == 1) {
			    cm.sendOk("今天已经领取过了...");
                cm.dispose();
                return;
			}
			if (拥有积分 < 积分宝箱[2]) {
                cm.sendOk("积分不足...");
                cm.dispose();
                return;
            }
				cm.gainMeso(积分宝箱奖励金币*3); //金币
				cm.gainItem(2450022,1);
                cm.gainItem(2022709,1);
                cm.gainItem(2022124,1);
				cm.setBossLog(""+积分宝箱[2]+"积分宝箱领取" + 获取日期);
                cm.sendOk("#k领取成功, 奖励"+积分宝箱奖励金币*3+"金币...");
			cm.dispose();
            } else if (selection == 积分宝箱[3]) {// 200积分宝箱
			if (cm.getMeso()+积分宝箱奖励金币*4 > 2100000000) {
			    cm.sendOk("背包金币过多, 请先存银行...");
                cm.dispose();
                return;
			}
			if (cm.getBossLog(""+积分宝箱[3]+"积分宝箱领取" + 获取日期) == 1) {
			    cm.sendOk("今天已经领取过了...");
                cm.dispose();
                return;
			}
			if (拥有积分 < 积分宝箱[3]) {
                cm.sendOk("积分不足...");
                cm.dispose();
                return;
            }
				cm.gainMeso(积分宝箱奖励金币*4); //金币
				cm.gainItem(2450022,1);
                cm.gainItem(2022709,1);
                cm.gainItem(2022124,1);
				cm.setBossLog(""+积分宝箱[3]+"积分宝箱领取" + 获取日期);
                cm.sendOk("#k领取成功, 奖励"+积分宝箱奖励金币*4+"金币...");
			cm.dispose();
            } else if (selection == 积分宝箱[5]) {// 300积分宝箱
			if (cm.getMeso()+积分宝箱奖励金币*6 > 2100000000) {
			    cm.sendOk("背包金币过多, 请先存银行...");
                cm.dispose();
                return;
			}
			if (cm.getBossLog(""+积分宝箱[5]+"积分宝箱领取" + 获取日期) == 1) {
			    cm.sendOk("今天已经领取过了...");
                cm.dispose();
                return;
			}
			if (拥有积分 < 积分宝箱[5]) {
                cm.sendOk("积分不足...");
                cm.dispose();
                return;
            }
				cm.gainMeso(积分宝箱奖励金币*6); //金币
				cm.gainNX2(20000)
				cm.gainNX(10000);
				cm.gainItem(2450022,1);
                cm.gainItem(2022709,1);
                cm.gainItem(2022124,1);
				cm.setBossLog(""+积分宝箱[5]+"积分宝箱领取" + 获取日期);
                cm.sendOk("#k领取成功, 奖励"+积分宝箱奖励金币*6+"金币...");
			cm.dispose();
            } /*if (selection == 积分宝箱[0]) {// 50积分宝箱送物品 此段备份 若想添加宝箱物品可在此修改
			if (cm.getBossLog(""+积分宝箱[0]+"积分宝箱领取" + 获取日期) == 1) {
			    cm.sendOk("今天已经领取过了...");
                cm.dispose();
                return;
			}
			if (拥有积分 < 积分宝箱[0]) {
                cm.sendOk("积分不足...");
                cm.dispose();
                return;
            }
				for (var o = 0; o < 积分宝箱奖励.length; o++) {						
				if (积分宝箱奖励[o][2] == 积分宝箱[0]) {	
				cm.gainItem(积分宝箱奖励[o][0], 积分宝箱奖励[o][1]);
				}
				}
				cm.gainMeso(积分宝箱奖励金币*2); //金币
				cm.setBossLog(""+积分宝箱[0]+"积分宝箱领取" + 获取日期);
                cm.sendOk("#k领取成功...");
			cm.dispose();
            }*/
			} else if (status == 2) {
			 if (towns == 1) { 
			 // if (cm.getMeso() >= 1000000) {
			 	if (cm.getPlayer().getCSPoints(1) > 3000){
		        		cm.gainNX(-3000);
						cm.warp(所有材料文本[selection][2], 0);
			// cm.gainMeso(-1000000);
					} else {
						// cm.sendOk("金币不足");
						cm.sendOk("你的点券不足3000.");
				        cm.dispose();
						}
						cm.dispose();
				}
				}
			}
			}