/* Author: Xterminator
	NPC Name: 		Cloy
	Map(s): 		Victoria Road : Henesys Park (100000200)
	Description: 		Pet Master
*/
var status = -1;

function action(mode, type, selection) {
    if (status == 1 && mode == 0 || status == 5 && mode == 1 || status == 10 && mode == 1 || status == 13 && mode == 1 || status == 15 && mode == 0　|| status == 0 && mode == -1) {
	cm.dispose();
	return;
	}
    if (mode == 1)
	status++;
    else
	status--;
    if (status == 0) {
	cm.sendNext("你... 是不是将我的孩子带在身边呢？　藉由使用生命水的魔法，我成功研发出賦予玩偶生命的魔法。　而人们将我获得生命的孩子称为 #b宠物#k。　如果持有宠物的话，任何事情都可以來问我。");
	} else if (status == 1) {
        cm.sendSimple("对于什么问題感到有兴趣呢？#b\r\n#L0#请針对宠物说明。#l\r\n#L1#宠物要怎么養？#l\r\n#L2#宠物也是会死吗？#l\r\n#L3#请告訴宠物貓,黑色貓的命令語。#l\r\n#L4#请告訴宠物狗的命令語。#l\r\n#L5#请告訴粉紅兔，白兔的命令語。#l\r\n#L6#请告訴小魔龙。#l\r\n#L7#请告訴麋鹿的命令語。#l\r\n#L8#请告訴黑色豬的命令語。#l\r\n#L9#请告訴熊貓的命令語。#l\r\n#L10#请告訴哈士奇的命令語。#l\r\n#L11#请告訴迪諾龙、妮諾龙的命令語。#l\r\n#L12#请告訴猴子的命令語。#l\r\n#L13#请告訴電子雞的命令語。#l\r\n#L14#请告訴白虎的命令語。#l\r\n#L15#请告訴企鵝的密令語。#l\r\n#L16#请告訴黃金豬的命令語。#l\r\n#L17#请告訴機器人的命令語。#l\r\n#L18#请告訴迷你雪吉拉的命令語。#l\r\n#L19#请告訴巴洛谷的命令語。#l\r\n#L20#请告訴神奇寶貝的命令語。#l\r\n#L21#请告訴绿紅藍的命令語。#l\r\n#L22#请告訴黑龙的命令語。#l\r\n#L23#请告訴黑色鬼精靈的命令語。#l\r\n#L24#请告訴豪豬的命令語。#l\r\n#L25#请告訴雪寶的命令語。#l\r\n#L26#请告訴臭鼬的命令語。#l\r\n#L27#请告訴我轉移宠物亲密度的方法。#l");
    } else if (status == 2) {
	if (selection == 0) {
	    status = 3;
	    cm.sendNext("想对宠物有所了解嘛。很久以前，我再做出的木偶身上用了生命水，透过魔法成功的做出了魔法动物。虽然难以相信，木偶成了有生命的生命體。它们能听懂人類的话，是很乖巧可爱的家伙。");
	} else if (selection == 1) {
	    status = 6;
	    cm.sendNext("宠物对于特別的指令会有高兴和难过等不同的反應。給宠物下指令后，听主人的话，就会提高与主人之间的亲密度。双擊宠物的话就能看到亲密度，等級，飽满度等資訊。");
	} else if (selection == 2) {
	    status = 11;
	    cm.sendNext("死掉啊！其实这些小家伙並不是真正活着的，所以它们会死，我也不知道对不对啊。这些小家伙是将我的魔法力量与生命水的力量灌注在木偶身體里做出來的。当然当它们活动的时候，是与其他动物沒什么兩樣");
	} else if (selection == 3) {
	    cm.sendNext("#r褐色小貓﹐黑色小貓#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b座#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 4) {
	    cm.sendNext("#r褐色小狗#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 5) {
	    cm.sendNext("#r粉紅兔子，白色兔子#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b抱抱#k (等級 10 ~ 30)\r\n#b睡觉, 困了, 去睡觉#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 6) {
	    cm.sendNext("#r小魔龙#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 7) {
	    cm.sendNext("#r麋鹿#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b聖誕快乐，聖誕快乐#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 11 ~ 30)\r\n#b寂寞, 孤獨#k (等級 11 ~ 30)\r\n#b撒嬌#k (等級 11 ~ 30)\r\n#b走#k (等級 21 ~ 30)");
	    cm.dispose();
	} else if (selection == 8) {
	    cm.sendNext("#r黑色豬#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 9) {
	    cm.sendNext("#r熊貓#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 10) {
	    cm.sendNext("#r哈士奇#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 11) {
	    cm.sendNext("#r迪諾龙、妮諾龙#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 12) {
	    cm.sendNext("#r猴子#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 13) {
	    cm.sendNext("#r電子雞#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 14) {
	    cm.sendNext("#r白虎#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 15) {
	    cm.sendNext("#r企鵝#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 16) {
	    cm.sendNext("#r黃金豬#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 17) {
	    cm.sendNext("#r機器人#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 18) {
	    cm.sendNext("#r迷你雪吉拉#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 19) {
	    cm.sendNext("#r巴洛谷#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 20) {
	    cm.sendNext("#r神奇寶貝#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 21) {
	    cm.sendNext("#r绿紅藍#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 22) {
	    cm.sendNext("#r黑龙#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 23) {
	    cm.sendNext("#r黑色鬼精靈#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 24) {
	    cm.sendNext("#r豪豬#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 25) {
	    cm.sendNext("#r雪寶#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 26) {
	    cm.sendNext("#r臭鼬#k的指令語旁边的等級意味着能够使用那條指令的宠物的等級。\r\n#b坐#k (等級 1 ~ 30)\r\n#b不要, 住手, 不行, 不可以#k (等級 1 ~ 30)\r\n#b笨蛋, 傻瓜, 討厭#k (等級 1 ~ 30)\r\n#b爱你#k (等級 1~30)\r\n#b便便#k (等級 1 ~ 30)\r\n#b说, 说吧, 说话#k (等級 10 ~ 30)\r\n#b撒嬌#k (等級 10 ~ 30)\r\n#b站, 站起來, 起來#k (等級 20 ~ 30)");
	    cm.dispose();
	} else if (selection == 27) {
	    status = 14;
	    cm.sendNext("为了移动宠物能力值需要魔法卷軸，带着这本書給艾靈森林的妖精瑪莉的话，就可以将你真心培育的宠物等級和亲密度移动其他宠物身上去。只給对于宠物如此关心的你而已，免費給你有點困难，所以只要支付25萬金币的话，就可以把書让給你，对了，即使有咒文書，如果沒有可移动的新宠物，也是沒有用的。");
	}
    } else if (status == 3) {
	cm.sendNext("可是那生命水只在世界樹的根部长出來一點點而已，不能賦予那些孩子太多的时间真可惜啊！不过就算变成木偶也能再賦予它生命，在一起要好好疼它哦。");
    } else if (status == 4) {
	cm.sendNextPrev("对了小家伙队特別指令会有所反應的。会鬧也会學乖一切都靠你发现了。小家伙们很害怕离开主人身边，要经常疼它们。別让它们孤獨哦");
    cm.dispose();
	} else if (status == 6) {
	cm.sendNext("经常和宠物聊天，关心它，亲密度就会提高，宠物的等級也会跟着提高。亲密度提高到某一程度时，宠物就会升級，等級高的话，还会學人说话，要努力撫養，当然不是那么容易吧");
    } else if (status == 7) {
	cm.sendNextPrev("虽然是木偶，可是这些家伙也有生命，也会觉得肚子餓的。#b飽满度#k是顯示肚子飽的程度的，最高是100，降到一定程度的，宠物会不听话等等，变得神经质呢。要多花點心思啊。");
    } else if (status == 8) {
	cm.sendNextPrev("对了！宠物不大喜欢吃人類的食物。我的徒弟#b科爾#k在弓箭手村的市集里賣#b宠物食品#k，如果需要食物就到弓箭手村去。最好先买好食物，以防宠物失去力氣哦。");
    } else if (status == 9) {
	cm.sendNext("阿对了！如果太久沒餵宠物吃東西的话它会自己回家。虽然下次将它拿出來在餵它也可以，但因为对健康不好，所以每一餐都要準时餵食喔。解说能够理解吗?");
	cm.safeDispose();
	} else if (status == 11) {
	cm.sendNext("过一段时间后对了！这些家伙会停掉的。就会恢復到原本木偶的樣子。魔法的力量和生命水用光的话，不过並不是永远停掉哦，再給它擦上生命水的话，就能復活哦。");
    } else if (status == 12) {
	cm.sendNextPrev("虽然能让它们恢復过來，不过停止还是让人满傷心的鎖已在它们活着的时候一定要好好爱护它们啊。可要記得按时餵它们。有一个生命，一直追隨你、关注你，你不觉得这是非常快乐的事情吗？");
    cm.dispose();
	} else if (status == 15) {
	cm.sendYesNo("将減去25萬金币，确定要购买吗？");
    } else if (status == 16) {
	if (cm.getMeso() < 250000) {
	    cm.sendOk("请确认是否有足够的金币，或者其他栏是否满了。");
	} else {
	    cm.gainMeso(-250000);
	    cm.gainItem(4160011, 1);
	}
	cm.safeDispose();
	return;
    }
}